#include <iostream>
#include <time.h>
#include <random>

using namespace std;

int main() {
	system("chcp 1251>nul"); // Windows
	srand(time(NULL));

	char arr[]{
		'0', '0', '0', '0', '0',
		'0', '0', '0', '0', '0',
		'0', '0', '0', '0', '0',
		'0', '0', '0', '0', '0',
		'0', '0', '0', '0', '0'
	};

	cout << "Це програма на розвиток інтуїції\n";
	cout << "У квадраті розміром 5 на 5 клітинок сховано скарб: гетьманські клейноди.\n";
	cout << "У тебе є 5 спроб, щоб знайти його\n\n";
	cout << "Press Space to Start\n";

	system("pause>nul"); // Windows
	system("cls");       // Windows

	int treasure = rand() % 25;
	int dig, рядок, стовпець;

	cout << "// treasure: " << treasure << "\n";

	for (int i = 1; i < 6; i++) { 
	x:  cout << "\n";
		for (int j = 0; j < 25; j++) {
			cout << arr[j];
			cout << " ";
			if (j == 4 || j == 9 || j == 14 || j == 19 || j == 24)
				cout << "\n";
		}
		cout << "\nСпроба #" << i << "\n";
		cout << "Введи номер рядка від 1 до 5: ";     cin >> рядок;
		cout << "Введи номер стовпця 1 до 5: ";     cin >> стовпець;

		if (!рядок) dig = рядок + стовпець;
		else dig = рядок * 5 - 5 + стовпець;

		if (dig == treasure) {
			system("cls"); // Windows
			cout << "Вітаю!!! Гетьманські клейноди віднайдено";
			return 0;
		}
		if (стовпець > 5 || стовпець < 1 || рядок > 5 || рядок < 1) {
			system("cls"); // Windows
			cout << "Ой. Нема таких координат. Спробуй ввести числа від 1 до 5:";
			goto x;
		}
		if (arr[dig - 1] == 'X') {
			system("cls"); // Windows
			cout << "Це вже було";
			goto x;
		}
		if (dig != treasure) {
			system("cls"); // Windows
			arr[dig - 1] = 'X';
			cout << "Тут нема. Де б це могло бути?";
		}
	}
	system("cls"); // Windows
	cout << "Кінець гри. Ви скористалися усіма спробами.";
	return 0;
}

/*
Створіть гру з пошуку скарбів. Задайте поле розміром 5х5. Випадковим чином розмістіть
на ньому скарб. Запропонуйте користувачеві вгадати, де він розташований. Для
вгадування користувач має ввести координати. Надайте максимально 5 спроб для
вгадування. Приклад реалізації програми мовою Пайтон можна переглянути тут.
Спробуйте написати аналогічну програму мовою С++.
*/
